# Pandas(Lokesh)
```
Used for managing data
Databases!
```

## Imports

In [ ]:
import pandas as pd
import numpy as np

## Lists, Arrays, Series

In [ ]:
myList=[1,2,3,4,5,99.8]
print(myList)
print('#-------------------------------break------------------------------------------------#')
myArray=np.array(myList)
print(myArray)
myseries1=pd.Series(data=myList)
print(myseries1)
print('#-------------------------------break------------------------------------------------#')
myseries2=pd.Series(data=myArray)
print(myseries2)
print('#-------------------------------break------------------------------------------------#')
print(myseries1[1])

[1, 2, 3, 4, 5, 99.8]
#-------------------------------break------------------------------------------------#
[ 1.   2.   3.   4.   5.  99.8]
0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5    99.8
dtype: float64
#-------------------------------break------------------------------------------------#
0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5    99.8
dtype: float64
#-------------------------------break------------------------------------------------#
2.0

## With indexes as labels

In [ ]:
myLabels=['wow',1,2,3,'yessssss',5]
myseries3=pd.Series(data=myList, index=myLabels)
print(myseries3)
print('#-------------------------------break------------------------------------------------#')
print(myseries3['wow'])
print('#-------------------------------break------------------------------------------------#')
print(myseries3[1])
print('#-------------------------------break------------------------------------------------#')
print(myseries3[2])

wow          1.0
1            2.0
2            3.0
3            4.0
yessssss     5.0
5           99.8
dtype: float64
#-------------------------------break------------------------------------------------#
1.0
#-------------------------------break------------------------------------------------#
2.0
#-------------------------------break------------------------------------------------#
3.0

## Math on series

In [ ]:
myseries4=pd.Series([5,3,4],['first','third','fourth'])
print(myseries4)
print('#-------------------------------break------------------------------------------------#')
print(myseries4+myseries3)

first     5
third     3
fourth    4
dtype: int64
#-------------------------------break------------------------------------------------#
1          NaN
2          NaN
3          NaN
5          NaN
first      NaN
fourth     NaN
third      NaN
wow        NaN
yessssss   NaN
dtype: float64

## Combine series to make a dataframe

In [ ]:
dataframe1=pd.concat([myseries3,myseries4],axis=1,sort=False)
dataframe1

             0    1
wow        1.0  NaN
1          2.0  NaN
2          3.0  NaN
3          4.0  NaN
yessssss   5.0  NaN
5         99.8  NaN
first      NaN  5.0
third      NaN  3.0
fourth     NaN  4.0

## Creating a dataframe

In [ ]:
dataframe2=pd.DataFrame(np.random.randn(5,5))
dataframe2

          0         1         2         3         4
0  0.457935  0.768414  0.168179  0.392801 -0.833217
1 -0.524026 -0.565031 -0.888307 -0.101963 -0.675314
2  0.848722  0.991583 -0.057208  0.103652 -1.337739
3 -0.533377 -2.322041 -1.622735 -0.467433  0.152063
4  0.950192 -0.656781  0.035638 -0.950017 -0.891419

In [ ]:
dataframe3=pd.DataFrame(np.random.randn(5,5),index=['first row','second row','third row','fourth row','fifth row'],columns=['first column','second column','third column','fourth column','fifth column'])
dataframe3

            first column  second column  ...  fourth column  fifth column
first row       0.638181       0.819852  ...      -0.530274     -0.688093
second row     -0.330950      -1.086920  ...      -1.192734      0.472579
third row       0.186830       1.013304  ...      -0.147025      0.652772
fourth row     -2.117801       2.142605  ...      -2.165704      0.903488
fifth row      -0.155236      -0.501709  ...       1.261132     -1.161820

[5 rows x 5 columns]

## Accessing induvidual and multiple columns

In [ ]:
print(dataframe3['second column'])
print('#-------------------------------break------------------------------------------------#')
dataframe3[['third column','first column']]

first row     0.819852
second row   -1.086920
third row     1.013304
fourth row    2.142605
fifth row    -0.501709
Name: second column, dtype: float64
#-------------------------------break------------------------------------------------#

            third column  first column
first row      -1.377639      0.638181
second row     -0.829291     -0.330950
third row      -0.671127      0.186830
fourth row      1.621769     -2.117801
fifth row      -1.569718     -0.155236

## Accessing induvidual and multiple rows

In [ ]:
dataframe3.loc['fourth row']

first column    -2.117801
second column    2.142605
third column     1.621769
fourth column   -2.165704
fifth column     0.903488
Name: fourth row, dtype: float64

In [ ]:
dataframe3.iloc[2]

first column     0.186830
second column    1.013304
third column    -0.671127
fourth column   -0.147025
fifth column     0.652772
Name: third row, dtype: float64

In [ ]:
dataframe3.loc[['fourth row','first row'],['second column','third column']]

            second column  third column
fourth row       2.142605      1.621769
first row        0.819852     -1.377639

## Greater or less than 0

In [ ]:
dataframe3>0

            first column  second column  ...  fourth column  fifth column
first row           True           True  ...          False         False
second row         False          False  ...          False          True
third row           True           True  ...          False          True
fourth row         False           True  ...          False          True
fifth row          False          False  ...           True         False

[5 rows x 5 columns]

In [ ]:
print(dataframe3[dataframe3>0])

            first column  second column  ...  fourth column  fifth column
first row       0.638181       0.819852  ...            NaN           NaN
second row           NaN            NaN  ...            NaN      0.472579
third row       0.186830       1.013304  ...            NaN      0.652772
fourth row           NaN       2.142605  ...            NaN      0.903488
fifth row            NaN            NaN  ...       1.261132           NaN

[5 rows x 5 columns]

## Add and remove columns

In [ ]:
dataframe3['sixth column']=np.random.randn(5,1)
dataframe3

            first column  second column  ...  fifth column  sixth column
first row       0.638181       0.819852  ...     -0.688093      1.037107
second row     -0.330950      -1.086920  ...      0.472579      0.013421
third row       0.186830       1.013304  ...      0.652772      2.138301
fourth row     -2.117801       2.142605  ...      0.903488     -0.146481
fifth row      -0.155236      -0.501709  ...     -1.161820     -0.868874

[5 rows x 6 columns]

In [ ]:
dataframe3.drop('first column',axis=1)

            second column  third column  ...  fifth column  sixth column
first row        0.819852     -1.377639  ...     -0.688093      1.037107
second row      -1.086920     -0.829291  ...      0.472579      0.013421
third row        1.013304     -0.671127  ...      0.652772      2.138301
fourth row       2.142605      1.621769  ...      0.903488     -0.146481
fifth row       -0.501709     -1.569718  ...     -1.161820     -0.868874

[5 rows x 5 columns]

In [ ]:
dataframe4=dataframe3.drop('second row',axis=0)
dataframe4

            first column  second column  ...  fifth column  sixth column
first row       0.638181       0.819852  ...     -0.688093      1.037107
third row       0.186830       1.013304  ...      0.652772      2.138301
fourth row     -2.117801       2.142605  ...      0.903488     -0.146481
fifth row      -0.155236      -0.501709  ...     -1.161820     -0.868874

[4 rows x 6 columns]

In [ ]:
dataframe4.reset_index()

        index  first column  ...  fifth column  sixth column
0   first row      0.638181  ...     -0.688093      1.037107
1   third row      0.186830  ...      0.652772      2.138301
2  fourth row     -2.117801  ...      0.903488     -0.146481
3   fifth row     -0.155236  ...     -1.161820     -0.868874

[4 rows x 7 columns]

In [ ]:
dataframe4.reset_index(inplace=True)
dataframe4

        index  first column  ...  fifth column  sixth column
0   first row      0.638181  ...     -0.688093      1.037107
1   third row      0.186830  ...      0.652772      2.138301
2  fourth row     -2.117801  ...      0.903488     -0.146481
3   fifth row     -0.155236  ...     -1.161820     -0.868874

[4 rows x 7 columns]

## Adding a new column with index

[Cell 1](https://colab.research.google.com/drive/1l--Q0ZAlReYc3skAj3OsixZW1qNsJgpL#scrollTo=LcAddayUb48k&line=1&uniqifier=1)

[Cell 2](https://colab.research.google.com/drive/1l--Q0ZAlReYc3skAj3OsixZW1qNsJgpL#scrollTo=KYa_0Oa8cQ8M&line=1&uniqifier=1)

In [ ]:
dataframe4['a new name']=['This','is','the','row']
dataframe4

        index  first column  ...  sixth column  a new name
0   first row      0.638181  ...      1.037107        This
1   third row      0.186830  ...      2.138301          is
2  fourth row     -2.117801  ...     -0.146481         the
3   fifth row     -0.155236  ...     -0.868874         row

[4 rows x 8 columns]

In [ ]:
dataframe4.set_index('a new name',inplace=True)
dataframe4

                 index  first column  ...  fifth column  sixth column
a new name                            ...
This         first row      0.638181  ...     -0.688093      1.037107
is           third row      0.186830  ...      0.652772      2.138301
the         fourth row     -2.117801  ...      0.903488     -0.146481
row          fifth row     -0.155236  ...     -1.161820     -0.868874

[4 rows x 7 columns]

## Combining dataframes
Combining dataframes is similar to SQL.

In [ ]:


df7 = pd.DataFrame({"customer":['101','102','103','104'], 
                    'category': ['cat2','cat2','cat1','cat3'],
                    'important': ['yes','no','yes','yes'],
                    'sales': [123,52,214,663]},index=[0,1,2,3])

df8 = pd.DataFrame({"customer":['101','103','104','105'], 
                    'color': ['yellow','green','green','blue'],
                    'distance': [12,9,44,21],
                    'sales': [123,214,663,331]},index=[4,5,6,7])

df9 = pd.DataFrame({"customer":['101','102','103','104'], 
                    'category': ['cat2','cat2','cat1','cat3'],
                    'important': ['yes','no','yes','yes'],
                    'sales': [123,52,214,663]})

df10 = pd.DataFrame({"customer":['101','103','104','105'], 
                    'color': ['yellow','green','green','blue'],
                    'distance': [12,9,44,21],
                    'sales': [123,214,663,331]})

In [ ]:
pd.concat([df7,df8],axis=0,sort=True)

  category   color customer  distance important  sales
0     cat2     NaN      101       NaN       yes    123
1     cat2     NaN      102       NaN        no     52
2     cat1     NaN      103       NaN       yes    214
3     cat3     NaN      104       NaN       yes    663
4      NaN  yellow      101      12.0       NaN    123
5      NaN   green      103       9.0       NaN    214
6      NaN   green      104      44.0       NaN    663
7      NaN    blue      105      21.0       NaN    331

In [ ]:
pd.concat([df7,df8],axis=1,sort=False)

  customer category important  sales customer   color  distance  sales
0      101     cat2       yes  123.0      NaN     NaN       NaN    NaN
1      102     cat2        no   52.0      NaN     NaN       NaN    NaN
2      103     cat1       yes  214.0      NaN     NaN       NaN    NaN
3      104     cat3       yes  663.0      NaN     NaN       NaN    NaN
4      NaN      NaN       NaN    NaN      101  yellow      12.0  123.0
5      NaN      NaN       NaN    NaN      103   green       9.0  214.0
6      NaN      NaN       NaN    NaN      104   green      44.0  663.0
7      NaN      NaN       NaN    NaN      105    blue      21.0  331.0

In [ ]:
pd.concat([df7,df8],axis=1,sort=True)

  customer category important  sales customer   color  distance  sales
0      101     cat2       yes  123.0      NaN     NaN       NaN    NaN
1      102     cat2        no   52.0      NaN     NaN       NaN    NaN
2      103     cat1       yes  214.0      NaN     NaN       NaN    NaN
3      104     cat3       yes  663.0      NaN     NaN       NaN    NaN
4      NaN      NaN       NaN    NaN      101  yellow      12.0  123.0
5      NaN      NaN       NaN    NaN      103   green       9.0  214.0
6      NaN      NaN       NaN    NaN      104   green      44.0  663.0
7      NaN      NaN       NaN    NaN      105    blue      21.0  331.0

In [ ]:
pd.concat([df9,df10],axis=0,sort=True)
print('#-------------------------------break------------------------------------------------#')
pd.concat([df9,df10],axis=0,sort=False)
print('#-------------------------------break------------------------------------------------#')
pd.concat([df9,df10],axis=1,sort=True)
print('#-------------------------------break------------------------------------------------#')
pd.concat([df9,df10],axis=1,sort=False)

#-------------------------------break------------------------------------------------#
#-------------------------------break------------------------------------------------#
#-------------------------------break------------------------------------------------#

  customer category important  sales customer   color  distance  sales
0      101     cat2       yes    123      101  yellow        12    123
1      102     cat2        no     52      103   green         9    214
2      103     cat1       yes    214      104   green        44    663
3      104     cat3       yes    663      105    blue        21    331

In [ ]:
pd.concat([df9,df10],axis=1,sort=True)

  customer category important  sales customer   color  distance  sales
0      101     cat2       yes    123      101  yellow        12    123
1      102     cat2        no     52      103   green         9    214
2      103     cat1       yes    214      104   green        44    663
3      104     cat3       yes    663      105    blue        21    331

In [ ]:
pd.concat([df9,df10],axis=0,sort=True)

  category   color customer  distance important  sales
0     cat2     NaN      101       NaN       yes    123
1     cat2     NaN      102       NaN        no     52
2     cat1     NaN      103       NaN       yes    214
3     cat3     NaN      104       NaN       yes    663
0      NaN  yellow      101      12.0       NaN    123
1      NaN   green      103       9.0       NaN    214
2      NaN   green      104      44.0       NaN    663
3      NaN    blue      105      21.0       NaN    331

In [ ]:
pd.concat([df9,df10],axis=0,sort=False)

  customer category important  sales customer   color  distance  sales
0      101     cat2       yes    123      101  yellow        12    123
1      102     cat2        no     52      103   green         9    214
2      103     cat1       yes    214      104   green        44    663
3      104     cat3       yes    663      105    blue        21    331

In [ ]:
pd.concat([df9,df10],axis=1,sort=False)

  customer category important  sales customer   color  distance  sales
0      101     cat2       yes    123      101  yellow        12    123
1      102     cat2        no     52      103   green         9    214
2      103     cat1       yes    214      104   green        44    663
3      104     cat3       yes    663      105    blue        21    331

## Merge and join

### Merge

In [ ]:
pd.merge(df7,df8,how='outer',on='customer')

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes      123  yellow        12      123
1      103     cat1       yes      214   green         9      214
2      104     cat3       yes      663   green        44      663

In [ ]:
pd.merge(df7,df8,how='inner',on='customer')

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes      123  yellow        12      123
1      103     cat1       yes      214   green         9      214
2      104     cat3       yes      663   green        44      663

In [ ]:
pd.merge(df7,df8,how='left',on='customer')

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes      123  yellow      12.0    123.0
1      102     cat2        no       52     NaN       NaN      NaN
2      103     cat1       yes      214   green       9.0    214.0
3      104     cat3       yes      663   green      44.0    663.0

In [ ]:
pd.merge(df7,df8,how='right',on='customer')

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes    123.0  yellow        12      123
1      103     cat1       yes    214.0   green         9      214
2      104     cat3       yes    663.0   green        44      663
3      105      NaN       NaN      NaN    blue        21      331

### Join

In [ ]:
df11 = pd.DataFrame({'Q1': [101,102,103],
                    'Q2': [201,202,203]},
                   index=['I0','I1','I2'])

df12 = pd.DataFrame({'Q3': [301,302,303],
                    'Q4': [401,402,403]},
                   index=['I0','I2','I3'])

In [ ]:
df11.join(df12,how='outer')

       Q1     Q2     Q3     Q4
I0  101.0  201.0  301.0  401.0
I1  102.0  202.0    NaN    NaN
I2  103.0  203.0  302.0  402.0
I3    NaN    NaN  303.0  403.0

In [ ]:
df11.join(df12,how='inner')

     Q1   Q2   Q3   Q4
I0  101  201  301  401
I2  103  203  302  402

In [ ]:
df11.join(df12,how='left')

     Q1   Q2     Q3     Q4
I0  101  201  301.0  401.0
I1  102  202    NaN    NaN
I2  103  203  302.0  402.0

In [ ]:
df11.join(df12,how='right')

       Q1     Q2   Q3   Q4
I0  101.0  201.0  301  401
I2  103.0  203.0  302  402
I3    NaN    NaN  303  403

## Functions of dataframes

In [ ]:
df8['color'].unique()

array(['yellow', 'green', 'blue'], dtype=object)

In [ ]:
df8['color'].value_counts()

green     2
blue      1
yellow    1
Name: color, dtype: int64

In [ ]:
df11.mean()

Q1    102.0
Q2    202.0
dtype: float64

In [ ]:
new_df=df8[(df8['customer']!='105') & (df8['color']!='green')]
new_df

  customer   color  distance  sales
4      101  yellow        12    123

In [ ]:
print(df8['sales'].sum())
print(df8['distance'].min())

1331
9

In [ ]:
def profit(s):
  return s*0.5

In [ ]:
df8['sales'].apply(profit)

4     61.5
5    107.0
6    331.5
7    165.5
Name: sales, dtype: float64

In [ ]:
df8['color'].apply(len)

4    6
5    5
6    5
7    4
Name: color, dtype: int64

In [ ]:
df13=df8[['distance','sales']]
df13.applymap(profit)

   distance  sales
4       6.0   61.5
5       4.5  107.0
6      22.0  331.5
7      10.5  165.5

In [ ]:
def col_sum(co):
  return sum(co)
df13.apply(col_sum)

In [ ]:
df13.applymap(col_sum) #doesnt work, applymap works entry by entry

TypeError: ignored

## Delete rows or columns

In [ ]:
del df8['color']
df8

  customer  distance  sales
4      101        12    123
5      103         9    214
6      104        44    663
7      105        21    331

## Index

In [ ]:
df8.index

Int64Index([4, 5, 6, 7], dtype='int64')

## Sorting the values

In [ ]:
df8.sort_values(by='distance')

  customer  distance  sales
5      103         9    214
4      101        12    123
7      105        21    331
6      104        44    663

## If some series has multiple of the same value then we can group all the unique entries together

In [ ]:
# if some series has multiple of the same value then we can group all the unique entries together
mydict = {'customer': ['Customer 1','Customer 1','Customer2','Customer2','Customer3','Customer3'], 
          'product1': [1.1,2.1,3.8,4.2,5.5,6.9],
          'product2': [8.2,9.1,11.1,5.2,44.66,983]}
df6 = pd.DataFrame(mydict,index=['Purchase 1','Purchase 2','Purchase 3','Purchase 4','Purchase 5','Purchase 6'])
df6

              customer  product1  product2
Purchase 1  Customer 1       1.1      8.20
Purchase 2  Customer 1       2.1      9.10
Purchase 3   Customer2       3.8     11.10
Purchase 4   Customer2       4.2      5.20
Purchase 5   Customer3       5.5     44.66
Purchase 6   Customer3       6.9    983.00

## Grouped Data
Very useful, see below

In [ ]:
grouped_data1=df6.groupby('customer')
print(grouped_data1)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7f769d596950>

In [ ]:
grouped_data1.describe() #makes pivot tables

           product1                      ... product2
              count mean       std  min  ...      25%     50%      75%    max
customer                                 ...
Customer 1      2.0  1.6  0.707107  1.1  ...    8.425    8.65    8.875    9.1
Customer2       2.0  4.0  0.282843  3.8  ...    6.675    8.15    9.625   11.1
Customer3       2.0  6.2  0.989949  5.5  ...  279.245  513.83  748.415  983.0

[3 rows x 16 columns]

In [ ]:
grouped_data1.std()

            product1    product2
customer
Customer 1  0.707107    0.636396
Customer2   0.282843    4.171930
Customer3   0.989949  663.506577

In [ ]:
grouped_data1.min()

            product1  product2
customer
Customer 1       1.1      8.20
Customer2        3.8      5.20
Customer3        5.5     44.66

In [ ]:
grouped_data1.max()

            product1  product2
customer
Customer 1       2.1       9.1
Customer2        4.2      11.1
Customer3        6.9     983.0

## Save and load dataframes to Excel and .csv files

In [5]:
df6.to_csv('df6.csv',index=True)

NameError: ignored